ConfigFiles/Enums/ТипыВеток.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыВеток</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновнаяВеткаПроекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВеткаВерсии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВеткаТехническогоПроекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВеткаДляИсправленияОшибок</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/Enums/ТипыВеток/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

//Возвращает массив типов веток, для отбора по типу ветки.
//
// Параметры:
//  ТипВетки      - Перечисление.ТипыВеток   - Тип ветки для установки отбора.
// 
// Возвращаемое значение:
//  Массив - Массив типов веток для отбора.
//
Функция ТипыВетокДляОтбора(ТипВетки) Экспорт
	
	Результат = Новый Массив;
	Если ТипВетки = Перечисления.ТипыВеток.ОсновнаяВеткаПроекта Тогда
		Результат.Добавить(Перечисления.ТипыВеток.ОсновнаяВеткаПроекта);
	ИначеЕсли ТипВетки = Перечисления.ТипыВеток.ВеткаВерсии Тогда
		Результат.Добавить(Перечисления.ТипыВеток.ОсновнаяВеткаПроекта);
		Результат.Добавить(Перечисления.ТипыВеток.ВеткаВерсии);
	ИначеЕсли ТипВетки = Перечисления.ТипыВеток.ВеткаТехническогоПроекта Тогда
		Результат.Добавить(Перечисления.ТипыВеток.ОсновнаяВеткаПроекта);
		Результат.Добавить(Перечисления.ТипыВеток.ВеткаВерсии);
		Результат.Добавить(Перечисления.ТипыВеток.ВеткаТехническогоПроекта);
	ИначеЕсли ТипВетки = Перечисления.ТипыВеток.ВеткаДляИсправленияОшибок Тогда
		Результат.Добавить(Перечисления.ТипыВеток.ОсновнаяВеткаПроекта);
		Результат.Добавить(Перечисления.ТипыВеток.ВеткаВерсии);
		Результат.Добавить(Перечисления.ТипыВеток.ВеткаТехническогоПроекта);
		Результат.Добавить(Перечисления.ТипыВеток.ВеткаДляИсправленияОшибок);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
